Revit 2026 API

# BuiltInFailuresRebarFailuresRebarShapeFailureDueToStaggerOffset Property

---

Can't solve Rebar Shape using the exisintg stagger offsets.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FailureDefinitionId RebarShapeFailureDueToStaggerOffset { get; }
```
```vb
Public Shared ReadOnly Property RebarShapeFailureDueToStaggerOffset As FailureDefinitionId
	Get
```
```cpp
public:
static property FailureDefinitionId^ RebarShapeFailureDueToStaggerOffset {
	FailureDefinitionId^ get ();
}
```
```fsharp
static member RebarShapeFailureDueToStaggerOffset : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId

#### Reference

BuiltInFailuresRebarFailures Class

Autodesk.Revit.DB Namespace